package study.samsung;

import java.io.*;
import java.util.*;

/*
입력1
3
0 0 0
0 0 0
0 9 0

출력1
0
================
입력2
3
0 0 1
0 0 0
0 9 0

출력2
3
================
입력3
4
4 3 2 1
0 0 0 0
0 0 9 0
1 2 3 4

출력3
14
================
입력4
6
5 4 3 2 3 4
4 3 2 3 4 5
3 2 9 5 6 6
2 1 2 3 4 5
3 2 1 6 5 4
6 6 6 6 6 6

출력4
60
================
입력5
6
6 0 6 0 6 1
0 0 0 0 0 2
2 3 4 5 6 6
0 0 0 0 0 2
0 2 0 0 0 0
3 9 3 0 0 1

출력5
48
================
입력6
6
1 1 1 1 1 1
2 2 6 2 2 3
2 2 5 2 2 3
2 2 2 4 6 3
0 0 0 0 0 6
0 0 0 0 0 9

출력6
39
 */

/**
 * https://www.acmicpc.net/problem/16236
 *
 * 아기 상어
 */
public class Baekjoon16236 {

    public static void main(String[] args) {

    }
}
